import 'package:da_blyat_voprosi_7/models/quiz_question.dart';

const questions = [
  QuizQuestion(
    'Назовите 17ю букву русского алфавита?',
    [
      'П',
      'О',
      'Р',
      'С',
    ],
  ),
  QuizQuestion(
    'Какая седьмая планета в Солнечной системе?',
    [
      'Уран',
      'Юпитер',
      'Сатурн',
      'Нептун',
    ],
  ),
  QuizQuestion(
    'Ты ГЕЙ или ПИДОРАС?',
    [
      'Тыкают хуй в жопу, а ко мне по имени обращаются',
      'Пидор',
      'Пидорас',
      'Гей',
    ],
  ),
  QuizQuestion(
    'Столица Испании?',
    [
      'Мадрид',
      'Барселона',
      'Севилья',
      'Валенсия',
    ],
  ),
  QuizQuestion(
    'Сколько пальцев я показываю?',
    [
      'Пальцы у тебя там, куда свет не попадает',
      '2',
      'Ты же компьютер, какие пальцы',
      '1',
    ],
  ),
  QuizQuestion(
    'В каком году был выпущен первый Айфон?',
    [
      '2007',
      '2005',
      '2006',
      '2004',
    ],
  ),
  QuizQuestion(
    'Есть два стула, на одном код дрочёный, на другом хуй точёный. На какой сам сядешь, на какой Кирилла посадишь?',
    [
      'Выкину нахуй стулья ваши пидорские',
      'Сяду на хуй точёный, а Кирилл на мой хуй дрочёный',
      'Стулья у вас кривые, одному код перепишу, дргуому хуй оторву',
      'Переверну 2 стула и всем 4ым курсом сядем',
    ],
  ),
  QuizQuestion(
    'В каком году закончилась Первая мировая война?',
    [
      '1918',
      '1914',
      '1916',
      '1912',
    ],
  ),
  QuizQuestion(
    'Пабажи ор прэй стэйшон фааайв',
    [
      'Прэй стэйшон файв',
      'Пабажи',
      'Экес Бокес Сэрес Экес',
      'лджтк',
    ],
  ),
  QuizQuestion(
    'Сколько континентов в мире?',
    [
      'Семь',
      'ШЕСТЬ',
      'Восемь',
      'Девять',
    ],
  ),
  QuizQuestion(
    'Какой подарок надо дарить друзьям?',
    [
      '4090',
      'xm4',
      'Хуй за щеку ночью',
      'Дать по жопе днём',
    ],
  ),
  QuizQuestion(
    'Кровеносные сосуды, которые уносят кровь из сердца, называются...',
    [
      'Артерии',
      'Вены',
      'Капилляры',
    ],
  ),
  QuizQuestion(
    'Продолжите фразу: Хочу заново...',
    [
      'Пидором стать',
      'Тебя завоевать',
      'Копать ебать',
      'Пизду лизать',
    ],
  ),
  QuizQuestion(
    'Какова температура замерзания воды?',
    [
      '0',
      '-1',
      '-5',
      'Температура такова и больше некакова',
    ],
  ),
  QuizQuestion(
    'Найдите лишнюю строчку',
    [
      'Niptun P▯▯idor',
      'Output device',
      'Input lag',
      'Tipun on your language',
    ],
  ),
];
